src/cfe/InformationRegisters/OData4_КэшМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_КэшМетаданных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Среда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Записан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_КэшМетаданныхЗапись/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Запись в кэш $metadata между сеансами (этап 8.3): всё, что создаёт наборы записей регистра OData4_КэшМетаданных.
// Отдельно от OData4_КэшМетаданных намеренно: в сеансе HTTP-сервиса, который не видит типов расширения (гонка начала
// сеанса, ИО-1), модуль с упоминанием менеджера регистра даёт неперехватываемый ответ 500 «Тип не определен» при
// первом вызове любой своей функции. Чтение и ключ записи (OData4_КэшМетаданных) менеджера не касаются, а этот
// модуль вызывается, только когда запрос к таблице кэша в том же вызове прошёл.

// Сохраняет документ Документ вида Вид по ключу записи и вытесняет устаревшие записи. Сбой — предупреждение в журнале
// регистрации, исключений нет.
Процедура Записать(КлючЗаписи, Вид, Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Набор = РегистрыСведений.OData4_КэшМетаданных.СоздатьНаборЗаписей();
		Набор.Отбор.Ключ.Установить(КлючЗаписи);
		Набор.Отбор.Вид.Установить(Вид);
		Запись = Набор.Добавить();
		Запись.Ключ = КлючЗаписи;
		Запись.Вид = Вид;
		Запись.Документ = Новый ХранилищеЗначения(Документ, Новый СжатиеДанных(6));
		Запись.Среда = OData4_КэшМетаданных.ОтпечатокСреды();
		Запись.Записан = ТекущаяУниверсальнаяДата();
		Запись.Размер = СтрДлина(Документ);
		Набор.Записать(Истина);
		Вытеснить(КлючЗаписи, Вид);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ЗаписьЖурналаРегистрации("OData4.КэшМетаданных", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Документ $metadata не сохранён в кэше: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Удаляет все записи кэша (тесты, сброс вручную). Возвращает число удалённых записей.
Функция Очистить() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ К.Ключ КАК Ключ, К.Вид КАК Вид ИЗ РегистрСведений.OData4_КэшМетаданных КАК К");
	Строки = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка0 Из Строки Цикл
		УдалитьЗапись(Строка0.Ключ, Строка0.Вид);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Строки.Количество();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Оставляет записи текущей среды и не больше НаибольшееЧислоЗаписей самых свежих (запись КлючЗаписи, Вид — только
// что записанная — не удаляется).
Процедура Вытеснить(КлючЗаписи, Вид)
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	К.Ключ КАК Ключ,
		|	К.Вид КАК Вид,
		|	К.Среда КАК Среда
		|ИЗ
		|	РегистрСведений.OData4_КэшМетаданных КАК К
		|УПОРЯДОЧИТЬ ПО
		|	К.Записан УБЫВ");
	Среда = OData4_КэшМетаданных.ОтпечатокСреды();
	// Только что записанная запись учтена сразу: время записи — с точностью до секунды, и в порядке УБЫВ она может
	// оказаться после других записей той же секунды.
	Оставлено = 1;
	Для Каждого Строка0 Из Запрос.Выполнить().Выгрузить() Цикл
		Если Строка0.Ключ = КлючЗаписи И Строка0.Вид = Вид Тогда
			Продолжить;
		КонецЕсли;
		Если Строка0.Среда = Среда И Оставлено < OData4_КэшМетаданных.НаибольшееЧислоЗаписей() Тогда
			Оставлено = Оставлено + 1;
			Продолжить;
		КонецЕсли;
		УдалитьЗапись(Строка0.Ключ, Строка0.Вид);
	КонецЦикла;
КонецПроцедуры

Процедура УдалитьЗапись(КлючЗаписи, Вид)
	Набор = РегистрыСведений.OData4_КэшМетаданных.СоздатьНаборЗаписей();
	Набор.Отбор.Ключ.Установить(КлючЗаписи);
	Набор.Отбор.Вид.Установить(Вид);
	Набор.Записать(Истина);
КонецПроцедуры

#КонецОбласти
